<html>
  <head>
    <title>codevis</title>
    <link
      rel="apple-touch-icon"
      sizes="180x180"
      href="../assets/favicon_package/apple-touch-icon.png"
    />
    <link
      rel="icon"
      type="image/png"
      sizes="32x32"
      href="../assets/favicon_package/favicon-32x32.png"
    />
    <link
      rel="icon"
      type="image/png"
      sizes="16x16"
      href="../assets/favicon_package/favicon-16x16.png"
    />
    <link rel="stylesheet" href="../style.css" />
    <link rel="preconnect" href="https://fonts.googleapis.com" />
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin />
    <script
      src="https://kit.fontawesome.com/9d935363fc.js"
      crossorigin="anonymous"
    ></script>
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
  </head>
  <body>
    <!-- Navigation -->
    <div class="navbar" id="navbar">
      <button class="hamburger" onclick="openNav()">
        <div class="menu-btn">
          <div class="menu-btn__burger"></div>
        </div>
      </button>
      <div class="logo">
        <a href="../" class="logo">
          <?xml version="1.0" encoding="utf-8"?>
          <svg
            class="logo-svg"
            version="1.1"
            id="Ebene_1"
            xmlns="http://www.w3.org/2000/svg"
            xmlns:xlink="http://www.w3.org/1999/xlink"
            x="0px"
            y="0px"
            viewBox="0 0 1920 1080"
            style="enable-background: new 0 0 1920 1080"
            xml:space="preserve"
          >
            <style type="text/css">
              .st0 {
                fill: none;
              }
              .st1 {
                fill: #294762;
              }
              .st2 {
                fill: #e65238;
              }
              .st3 {
                fill: url(#SVGID_1_);
              }
              .st4 {
                fill: #a8dadc;
              }
              .st5 {
                fill: #e6e6e6;
              }
            </style>
            <g id="Baba2_00000075862812243650940450000008594686658069554060_">
              <path
                class="st0"
                d="M1626.49,347.65c0,0-221.06,126.78-333.25,192.4L1626.49,347.65z"
              />
              <path
                class="st1"
                d="M627.64,539.54L960,347.65c0,0-186.06-108.22-302.97-175.12c-18.72-10.71-41.72-10.67-60.39,0.11L323.8,330.16
		c-18.75,10.82-30.29,30.83-30.29,52.47l0,349.82l333.24-192.4L627.64,539.54z"
              />
              <path
                class="st2"
                d="M293.51,732.45l302.95,174.91c18.75,10.82,41.84,10.82,60.59,0L960,732.45l-333.25-192.4L293.51,732.45z"
              />
              <polygon
                class="st2"
                points="626.75,540.05 293.51,732.45 626.75,540.05 	"
              />
              <linearGradient
                id="SVGID_1_"
                gradientUnits="userSpaceOnUse"
                x1="626.751"
                y1="631.5631"
                x2="1626.4935"
                y2="631.5631"
              >
                <stop offset="0" style="stop-color: #99cccc" />
                <stop offset="1" style="stop-color: #a8dadc" />
              </linearGradient>
              <path
                class="st3"
                d="M1626.49,697.47l0-349.82l-333.25,192.4C1180.35,475.84,960,347.65,960,347.65L627.64,539.54l-0.89,0.52
		L960,732.45l0,0l302.95,174.91c18.75,10.82,41.84,10.82,60.59,0l272.66-157.42C1614.95,739.12,1626.49,719.11,1626.49,697.47z"
              />
              <polygon
                class="st4"
                points="626.75,540.05 627.64,539.54 626.75,540.05 	"
              />
              <rect
                x="793.37"
                y="443.85"
                class="st4"
                width="0"
                height="384.8"
              />
              <polygon
                class="st4"
                points="626.75,540.05 626.75,540.05 626.75,540.05 	"
              />
              <path
                class="st5"
                d="M1626.49,347.65l-302.95-174.91c-18.75-10.82-41.84-10.82-60.59,0L960,347.65l333.25,192.4
		C1405.44,474.43,1626.49,347.65,1626.49,347.65z"
              />
              <path
                class="st5"
                d="M960,347.65c0,0,220.35,128.19,333.25,192.4L960,347.65z"
              />
            </g>
          </svg>
          <h5 class="logo-text">codevis</h5>
        </a>
      </div>
      <div class="navigation visibility" id="navigation">
        <a class="font2 bold nav-link" href="../projects">Projekte</a>
        <a class="font2 bold nav-link" href="../about">Über Uns</a>
        <button
          class="font2 bold button1 navbar-button"
          onclick="window.location.href='../contact'"
        >
          Kontakt
        </button>
      </div>
    </div>
    <!-- End Navigation -->
    <!-- Banner -->
    <div class="section project-header-section">
      <div class="headercontainer">
        <div class="catch-phrase">
          <h1 class="dsgvoh1">Datenschutzerklärung</h1>
          <p class="medium subheading">
            Bei rechtlichen Fragen bitte das Kontaktformular verwenden.
          </p>
        </div>
      </div>
    </div>
    <!-- End Banner -->
    <!-- DSGVO -->
    <div class="ellipse blue2"></div>
    <div class="blue2 ellipse-fix">
      <div class="section dsgvo-section">
        <h3 class="dsgvoh3">1. Datenschutz auf einen Blick</h3>
        <h5 class="dsgvoh5">Allgemeine Hinweise</h5> <p class="dsgvop">Die folgenden Hinweise geben einen einfachen &Uuml;berblick dar&uuml;ber, was mit Ihren personenbezogenen Daten passiert, wenn Sie diese Website besuchen. Personenbezogene Daten sind alle Daten, mit denen Sie pers&ouml;nlich identifiziert werden k&ouml;nnen. Ausf&uuml;hrliche Informationen zum Thema Datenschutz entnehmen Sie unserer unter diesem Text aufgef&uuml;hrten Datenschutzerkl&auml;rung.</p>
        <h5 class="dsgvoh5">Datenerfassung auf dieser Website</h5> <h5 class="dsgvoh5">Wer ist verantwortlich f&uuml;r die Datenerfassung auf dieser Website?</h5> <p class="dsgvop">Die Datenverarbeitung auf dieser Website erfolgt durch den Websitebetreiber. Dessen Kontaktdaten k&ouml;nnen Sie dem Abschnitt &bdquo;Hinweis zur Verantwortlichen Stelle&ldquo; in dieser Datenschutzerkl&auml;rung entnehmen.</p> <h5 class="dsgvoh5">Wie erfassen wir Ihre Daten?</h5> <p class="dsgvop">Ihre Daten werden zum einen dadurch erhoben, dass Sie uns diese mitteilen. Hierbei kann es sich z.&nbsp;B. um Daten handeln, die Sie in ein Kontaktformular eingeben.</p> <p class="dsgvop">Andere Daten werden automatisch oder nach Ihrer Einwilligung beim Besuch der Website durch unsere IT-Systeme erfasst. Das sind vor allem technische Daten (z.&nbsp;B. Internetbrowser, Betriebssystem oder Uhrzeit des Seitenaufrufs). Die Erfassung dieser Daten erfolgt automatisch, sobald Sie diese Website betreten.</p> <h5 class="dsgvoh5">Wof&uuml;r nutzen wir Ihre Daten?</h5> <p class="dsgvop">Ein Teil der Daten wird erhoben, um eine fehlerfreie Bereitstellung der Website zu gew&auml;hrleisten. Andere Daten k&ouml;nnen zur Analyse Ihres Nutzerverhaltens verwendet werden.</p> <h5 class="dsgvoh5">Welche Rechte haben Sie bez&uuml;glich Ihrer Daten?</h5> <p class="dsgvop">Sie haben jederzeit das Recht, unentgeltlich Auskunft &uuml;ber Herkunft, Empf&auml;nger und Zweck Ihrer gespeicherten personenbezogenen Daten zu erhalten. Sie haben au&szlig;erdem ein Recht, die Berichtigung oder L&ouml;schung dieser Daten zu verlangen. Wenn Sie eine Einwilligung zur Datenverarbeitung erteilt haben, k&ouml;nnen Sie diese Einwilligung jederzeit f&uuml;r die Zukunft widerrufen. Au&szlig;erdem haben Sie das Recht, unter bestimmten Umst&auml;nden die Einschr&auml;nkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen. Des Weiteren steht Ihnen ein Beschwerderecht bei der zust&auml;ndigen Aufsichtsbeh&ouml;rde zu.</p> <p class="dsgvop">Hierzu sowie zu weiteren Fragen zum Thema Datenschutz k&ouml;nnen Sie sich jederzeit an uns wenden.</p>
        <h3 class="dsgvoh3">2. Hosting</h3>
        <h5 class="dsgvoh5">Externes Hosting</h5> <p class="dsgvop">Diese Website wird bei einem externen Dienstleister gehostet (Hoster). Die personenbezogenen Daten, die auf dieser Website erfasst werden, werden auf den Servern des Hosters gespeichert. Hierbei kann es sich v.&nbsp;a. um IP-Adressen, Kontaktanfragen, Meta- und Kommunikationsdaten, Vertragsdaten, Kontaktdaten, Namen, Websitezugriffe und sonstige Daten, die &uuml;ber eine Website generiert werden, handeln.</p> <p class="dsgvop">Der Einsatz des Hosters erfolgt zum Zwecke der Vertragserf&uuml;llung gegen&uuml;ber unseren potenziellen und bestehenden Kunden (Art. 6 Abs. 1 lit. b DSGVO) und im Interesse einer sicheren, schnellen und effizienten Bereitstellung unseres Online-Angebots durch einen professionellen Anbieter (Art. 6 Abs. 1 lit. f DSGVO). Sofern eine entsprechende Einwilligung abgefragt wurde, erfolgt die Verarbeitung ausschlie&szlig;lich auf Grundlage von Art. 6 Abs. 1 lit. a DSGVO und &sect; 25 Abs. 1 TTDSG, soweit die Einwilligung die Speicherung von Cookies oder den Zugriff auf Informationen im Endger&auml;t des Nutzers (z.&nbsp;B. Device-Fingerprinting) im Sinne des TTDSG umfasst. Die Einwilligung ist jederzeit widerrufbar.</p> <p class="dsgvop">Unser Hoster wird Ihre Daten nur insoweit verarbeiten, wie dies zur Erf&uuml;llung seiner Leistungspflichten erforderlich ist und unsere Weisungen in Bezug auf diese Daten befolgen.</p> <p class="dsgvop">Wir setzen folgenden Hoster ein:</p>
        <p class="dsgvop">Github Pages</p>
        <h3 class="dsgvoh3">3. Allgemeine Hinweise und Pflicht&shy;informationen</h3>
        <h5 class="dsgvoh5">Datenschutz</h5> <p class="dsgvop">Die Betreiber dieser Seiten nehmen den Schutz Ihrer pers&ouml;nlichen Daten sehr ernst. Wir behandeln Ihre personenbezogenen Daten vertraulich und entsprechend den gesetzlichen Datenschutzvorschriften sowie dieser Datenschutzerkl&auml;rung.</p> <p class="dsgvop">Wenn Sie diese Website benutzen, werden verschiedene personenbezogene Daten erhoben. Personenbezogene Daten sind Daten, mit denen Sie pers&ouml;nlich identifiziert werden k&ouml;nnen. Die vorliegende Datenschutzerkl&auml;rung erl&auml;utert, welche Daten wir erheben und wof&uuml;r wir sie nutzen. Sie erl&auml;utert auch, wie und zu welchem Zweck das geschieht.</p> <p class="dsgvop">Wir weisen darauf hin, dass die Daten&uuml;bertragung im Internet (z.&nbsp;B. bei der Kommunikation per E-Mail) Sicherheitsl&uuml;cken aufweisen kann. Ein l&uuml;ckenloser Schutz der Daten vor dem Zugriff durch Dritte ist nicht m&ouml;glich.</p>
        <h5 class="dsgvoh5">Hinweis zur verantwortlichen Stelle</h5> <p class="dsgvop">Die verantwortliche Stelle f&uuml;r die Datenverarbeitung auf dieser Website ist:</p> <p class="dsgvop">codevis</p>

        E-Mail: codevis.dev@gmail.com</p>
        <p class="dsgvop">Verantwortliche Stelle ist die nat&uuml;rliche oder juristische Person, die allein oder gemeinsam mit anderen &uuml;ber die Zwecke und Mittel der Verarbeitung von personenbezogenen Daten (z.&nbsp;B. Namen, E-Mail-Adressen o. &Auml;.) entscheidet.</p>

<h5 class="dsgvoh5">Speicherdauer</h5> <p class="dsgvop">Soweit innerhalb dieser Datenschutzerkl&auml;rung keine speziellere Speicherdauer genannt wurde, verbleiben Ihre personenbezogenen Daten bei uns, bis der Zweck f&uuml;r die Datenverarbeitung entf&auml;llt. Wenn Sie ein berechtigtes L&ouml;schersuchen geltend machen oder eine Einwilligung zur Datenverarbeitung widerrufen, werden Ihre Daten gel&ouml;scht, sofern wir keine anderen rechtlich zul&auml;ssigen Gr&uuml;nde f&uuml;r die Speicherung Ihrer personenbezogenen Daten haben (z.&nbsp;B. steuer- oder handelsrechtliche Aufbewahrungsfristen); im letztgenannten Fall erfolgt die L&ouml;schung nach Fortfall dieser Gr&uuml;nde.</p>
<h5 class="dsgvoh5">Allgemeine Hinweise zu den Rechtsgrundlagen der Datenverarbeitung auf dieser Website</h5> <p class="dsgvop">Sofern Sie in die Datenverarbeitung eingewilligt haben, verarbeiten wir Ihre personenbezogenen Daten auf Grundlage von Art. 6 Abs. 1 lit. a DSGVO bzw. Art. 9 Abs. 2 lit. a DSGVO, sofern besondere Datenkategorien nach Art. 9 Abs. 1 DSGVO verarbeitet werden. Im Falle einer ausdr&uuml;cklichen Einwilligung in die &Uuml;bertragung personenbezogener Daten in Drittstaaten erfolgt die Datenverarbeitung au&szlig;erdem auf Grundlage von Art. 49 Abs. 1 lit. a DSGVO. Sofern Sie in die Speicherung von Cookies oder in den Zugriff auf Informationen in Ihr Endger&auml;t (z.&nbsp;B. via Device-Fingerprinting) eingewilligt haben, erfolgt die Datenverarbeitung zus&auml;tzlich auf Grundlage von &sect; 25 Abs. 1 TTDSG. Die Einwilligung ist jederzeit widerrufbar. Sind Ihre Daten zur Vertragserf&uuml;llung oder zur Durchf&uuml;hrung vorvertraglicher Ma&szlig;nahmen erforderlich, verarbeiten wir Ihre Daten auf Grundlage des Art. 6 Abs. 1 lit. b DSGVO. Des Weiteren verarbeiten wir Ihre Daten, sofern diese zur Erf&uuml;llung einer rechtlichen Verpflichtung erforderlich sind auf Grundlage von Art. 6 Abs. 1 lit. c DSGVO. Die Datenverarbeitung kann ferner auf Grundlage unseres berechtigten Interesses nach Art. 6 Abs. 1 lit. f DSGVO erfolgen. &Uuml;ber die jeweils im Einzelfall einschl&auml;gigen Rechtsgrundlagen wird in den folgenden Abs&auml;tzen dieser Datenschutzerkl&auml;rung informiert.</p>
<h5 class="dsgvoh5">Hinweis zur Datenweitergabe in die USA und sonstige Drittstaaten</h5> <p class="dsgvop">Wir verwenden unter anderem Tools von Unternehmen mit Sitz in den USA oder sonstigen datenschutzrechtlich nicht sicheren Drittstaaten. Wenn diese Tools aktiv sind, k&ouml;nnen Ihre personenbezogene Daten in diese Drittstaaten &uuml;bertragen und dort verarbeitet werden. Wir weisen darauf hin, dass in diesen L&auml;ndern kein mit der EU vergleichbares Datenschutzniveau garantiert werden kann. Beispielsweise sind US-Unternehmen dazu verpflichtet, personenbezogene Daten an Sicherheitsbeh&ouml;rden herauszugeben, ohne dass Sie als Betroffener hiergegen gerichtlich vorgehen k&ouml;nnten. Es kann daher nicht ausgeschlossen werden, dass US-Beh&ouml;rden (z.&nbsp;B. Geheimdienste) Ihre auf US-Servern befindlichen Daten zu &Uuml;berwachungszwecken verarbeiten, auswerten und dauerhaft speichern. Wir haben auf diese Verarbeitungst&auml;tigkeiten keinen Einfluss.</p><h5 class="dsgvoh5">Widerruf Ihrer Einwilligung zur Datenverarbeitung</h5> <p class="dsgvop">Viele Datenverarbeitungsvorg&auml;nge sind nur mit Ihrer ausdr&uuml;cklichen Einwilligung m&ouml;glich. Sie k&ouml;nnen eine bereits erteilte Einwilligung jederzeit widerrufen. Die Rechtm&auml;&szlig;igkeit der bis zum Widerruf erfolgten Datenverarbeitung bleibt vom Widerruf unber&uuml;hrt.</p>
<h5 class="dsgvoh5">Widerspruchsrecht gegen die Datenerhebung in besonderen F&auml;llen sowie gegen Direktwerbung (Art. 21 DSGVO)</h5> <p class="dsgvop">WENN DIE DATENVERARBEITUNG AUF GRUNDLAGE VON ART. 6 ABS. 1 LIT. E ODER F DSGVO ERFOLGT, HABEN SIE JEDERZEIT DAS RECHT, AUS GR&Uuml;NDEN, DIE SICH AUS IHRER BESONDEREN SITUATION ERGEBEN, GEGEN DIE VERARBEITUNG IHRER PERSONENBEZOGENEN DATEN WIDERSPRUCH EINZULEGEN; DIES GILT AUCH F&Uuml;R EIN AUF DIESE BESTIMMUNGEN GEST&Uuml;TZTES PROFILING. DIE JEWEILIGE RECHTSGRUNDLAGE, AUF DENEN EINE VERARBEITUNG BERUHT, ENTNEHMEN SIE DIESER DATENSCHUTZERKL&Auml;RUNG. WENN SIE WIDERSPRUCH EINLEGEN, WERDEN WIR IHRE BETROFFENEN PERSONENBEZOGENEN DATEN NICHT MEHR VERARBEITEN, ES SEI DENN, WIR K&Ouml;NNEN ZWINGENDE SCHUTZW&Uuml;RDIGE GR&Uuml;NDE F&Uuml;R DIE VERARBEITUNG NACHWEISEN, DIE IHRE INTERESSEN, RECHTE UND FREIHEITEN &Uuml;BERWIEGEN ODER DIE VERARBEITUNG DIENT DER GELTENDMACHUNG, AUS&Uuml;BUNG ODER VERTEIDIGUNG VON RECHTSANSPR&Uuml;CHEN (WIDERSPRUCH NACH ART. 21 ABS. 1 DSGVO).</p> <p class="dsgvop">WERDEN IHRE PERSONENBEZOGENEN DATEN VERARBEITET, UM DIREKTWERBUNG ZU BETREIBEN, SO HABEN SIE DAS RECHT, JEDERZEIT WIDERSPRUCH GEGEN DIE VERARBEITUNG SIE BETREFFENDER PERSONENBEZOGENER DATEN ZUM ZWECKE DERARTIGER WERBUNG EINZULEGEN; DIES GILT AUCH F&Uuml;R DAS PROFILING, SOWEIT ES MIT SOLCHER DIREKTWERBUNG IN VERBINDUNG STEHT. WENN SIE WIDERSPRECHEN, WERDEN IHRE PERSONENBEZOGENEN DATEN ANSCHLIESSEND NICHT MEHR ZUM ZWECKE DER DIREKTWERBUNG VERWENDET (WIDERSPRUCH NACH ART. 21 ABS. 2 DSGVO).</p>
<h5 class="dsgvoh5">Beschwerde&shy;recht bei der zust&auml;ndigen Aufsichts&shy;beh&ouml;rde</h5> <p class="dsgvop">Im Falle von Verst&ouml;&szlig;en gegen die DSGVO steht den Betroffenen ein Beschwerderecht bei einer Aufsichtsbeh&ouml;rde, insbesondere in dem Mitgliedstaat ihres gew&ouml;hnlichen Aufenthalts, ihres Arbeitsplatzes oder des Orts des mutma&szlig;lichen Versto&szlig;es zu. Das Beschwerderecht besteht unbeschadet anderweitiger verwaltungsrechtlicher oder gerichtlicher Rechtsbehelfe.</p>
<h5 class="dsgvoh5">Recht auf Daten&shy;&uuml;bertrag&shy;barkeit</h5> <p class="dsgvop">Sie haben das Recht, Daten, die wir auf Grundlage Ihrer Einwilligung oder in Erf&uuml;llung eines Vertrags automatisiert verarbeiten, an sich oder an einen Dritten in einem g&auml;ngigen, maschinenlesbaren Format aush&auml;ndigen zu lassen. Sofern Sie die direkte &Uuml;bertragung der Daten an einen anderen Verantwortlichen verlangen, erfolgt dies nur, soweit es technisch machbar ist.</p>
<h5 class="dsgvoh5">Auskunft, L&ouml;schung und Berichtigung</h5> <p class="dsgvop">Sie haben im Rahmen der geltenden gesetzlichen Bestimmungen jederzeit das Recht auf unentgeltliche Auskunft &uuml;ber Ihre gespeicherten personenbezogenen Daten, deren Herkunft und Empf&auml;nger und den Zweck der Datenverarbeitung und ggf. ein Recht auf Berichtigung oder L&ouml;schung dieser Daten. Hierzu sowie zu weiteren Fragen zum Thema personenbezogene Daten k&ouml;nnen Sie sich jederzeit an uns wenden.</p>
<h5 class="dsgvoh5">Recht auf Einschr&auml;nkung der Verarbeitung</h5> <p class="dsgvop">Sie haben das Recht, die Einschr&auml;nkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen. Hierzu k&ouml;nnen Sie sich jederzeit an uns wenden. Das Recht auf Einschr&auml;nkung der Verarbeitung besteht in folgenden F&auml;llen:</p> <ul class="dsgvop"> <li>Wenn Sie die Richtigkeit Ihrer bei uns gespeicherten personenbezogenen Daten bestreiten, ben&ouml;tigen wir in der Regel Zeit, um dies zu &uuml;berpr&uuml;fen. F&uuml;r die Dauer der Pr&uuml;fung haben Sie das Recht, die Einschr&auml;nkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen.</li> <li>Wenn die Verarbeitung Ihrer personenbezogenen Daten unrechtm&auml;&szlig;ig geschah/geschieht, k&ouml;nnen Sie statt der L&ouml;schung die Einschr&auml;nkung der Datenverarbeitung verlangen.</li> <li>Wenn wir Ihre personenbezogenen Daten nicht mehr ben&ouml;tigen, Sie sie jedoch zur Aus&uuml;bung, Verteidigung oder Geltendmachung von Rechtsanspr&uuml;chen ben&ouml;tigen, haben Sie das Recht, statt der L&ouml;schung die Einschr&auml;nkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen.</li> <li>Wenn Sie einen Widerspruch nach Art. 21 Abs. 1 DSGVO eingelegt haben, muss eine Abw&auml;gung zwischen Ihren und unseren Interessen vorgenommen werden. Solange noch nicht feststeht, wessen Interessen &uuml;berwiegen, haben Sie das Recht, die Einschr&auml;nkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen.</li> </ul> <p class="dsgvop">Wenn Sie die Verarbeitung Ihrer personenbezogenen Daten eingeschr&auml;nkt haben, d&uuml;rfen diese Daten &ndash; von ihrer Speicherung abgesehen &ndash; nur mit Ihrer Einwilligung oder zur Geltendmachung, Aus&uuml;bung oder Verteidigung von Rechtsanspr&uuml;chen oder zum Schutz der Rechte einer anderen nat&uuml;rlichen oder juristischen Person oder aus Gr&uuml;nden eines wichtigen &ouml;ffentlichen Interesses der Europ&auml;ischen Union oder eines Mitgliedstaats verarbeitet werden.</p>
<h5 class="dsgvoh5">SSL- bzw. TLS-Verschl&uuml;sselung</h5> <p class="dsgvop">Diese Seite nutzt aus Sicherheitsgr&uuml;nden und zum Schutz der &Uuml;bertragung vertraulicher Inhalte, wie zum Beispiel Bestellungen oder Anfragen, die Sie an uns als Seitenbetreiber senden, eine SSL- bzw. TLS-Verschl&uuml;sselung. Eine verschl&uuml;sselte Verbindung erkennen Sie daran, dass die Adresszeile des Browsers von &bdquo;http://&ldquo; auf &bdquo;https://&ldquo; wechselt und an dem Schloss-Symbol in Ihrer Browserzeile.</p> <p class="dsgvop">Wenn die SSL- bzw. TLS-Verschl&uuml;sselung aktiviert ist, k&ouml;nnen die Daten, die Sie an uns &uuml;bermitteln, nicht von Dritten mitgelesen werden.</p>
<h3 class="dsgvoh3">4. Plugins und Tools</h3>
<h5 class="dsgvoh5">Google Web Fonts</h5> <p class="dsgvop">Diese Seite nutzt zur einheitlichen Darstellung von Schriftarten so genannte Web Fonts, die von Google bereitgestellt werden. Beim Aufruf einer Seite l&auml;dt Ihr Browser die ben&ouml;tigten Web Fonts in ihren Browsercache, um Texte und Schriftarten korrekt anzuzeigen.</p> <p class="dsgvop">Zu diesem Zweck muss der von Ihnen verwendete Browser Verbindung zu den Servern von Google aufnehmen. Hierdurch erlangt Google Kenntnis dar&uuml;ber, dass &uuml;ber Ihre IP-Adresse diese Website aufgerufen wurde. Die Nutzung von Google WebFonts erfolgt auf Grundlage von Art. 6 Abs. 1 lit. f DSGVO. Der Websitebetreiber hat ein berechtigtes Interesse an der einheitlichen Darstellung des Schriftbildes auf seiner Website. Sofern eine entsprechende Einwilligung abgefragt wurde, erfolgt die Verarbeitung ausschlie&szlig;lich auf Grundlage von Art. 6 Abs. 1 lit. a DSGVO und &sect; 25 Abs. 1 TTDSG, soweit die Einwilligung die Speicherung von Cookies oder den Zugriff auf Informationen im Endger&auml;t des Nutzers (z.&nbsp;B. Device-Fingerprinting) im Sinne des TTDSG umfasst. Die Einwilligung ist jederzeit widerrufbar.</p> <p class="dsgvop">Wenn Ihr Browser Web Fonts nicht unterst&uuml;tzt, wird eine Standardschrift von Ihrem Computer genutzt.</p> <p class="dsgvop mini">Weitere Informationen zu Google Web Fonts finden Sie unter <a href="https://developers.google.com/fonts/faq" target="_blank" rel="noopener noreferrer">https://developers.google.com/fonts/faq</a> und in der Datenschutzerkl&auml;rung von Google: <a href="https://policies.google.com/privacy?hl=de" target="_blank" rel="noopener noreferrer">https://policies.google.com/privacy?hl=de</a>.</p>
        </div>
      </div>
    </div>
    <!-- DSGVO -->
    <!-- Footer -->
    <div class="ellipse black"></div>
    <div class="footer">
      <button
        class="button1 b1 footer-mobile-shown footer-button"
        onclick="window.location.href='../contact'"
      >
        <span class="footer-button-text">Kontakt</span>
      </button>
      <div class="end-logo">
        <a href="../" class="end-logo">
          <?xml version="1.0" encoding="utf-8"?>
          <svg
            class="end-logo-svg"
            version="1.1"
            id="Ebene_1"
            xmlns="http://www.w3.org/2000/svg"
            xmlns:xlink="http://www.w3.org/1999/xlink"
            x="0px"
            y="0px"
            viewBox="0 0 1920 1080"
            style="enable-background: new 0 0 1920 1080"
            xml:space="preserve"
          >
            <style type="text/css">
              .st0 {
                fill: none;
              }
              .st1 {
                fill: #294762;
              }
              .st2 {
                fill: #e65238;
              }
              .st3 {
                fill: url(#SVGID_1_);
              }
              .st4 {
                fill: #a8dadc;
              }
              .st5 {
                fill: #e6e6e6;
              }
            </style>
            <g id="Baba2_00000075862812243650940450000008594686658069554060_">
              <path
                class="st0"
                d="M1626.49,347.65c0,0-221.06,126.78-333.25,192.4L1626.49,347.65z"
              />
              <path
                class="st1"
                d="M627.64,539.54L960,347.65c0,0-186.06-108.22-302.97-175.12c-18.72-10.71-41.72-10.67-60.39,0.11L323.8,330.16
  c-18.75,10.82-30.29,30.83-30.29,52.47l0,349.82l333.24-192.4L627.64,539.54z"
              />
              <path
                class="st2"
                d="M293.51,732.45l302.95,174.91c18.75,10.82,41.84,10.82,60.59,0L960,732.45l-333.25-192.4L293.51,732.45z"
              />
              <polygon
                class="st2"
                points="626.75,540.05 293.51,732.45 626.75,540.05 	"
              />
              <linearGradient
                id="SVGID_1_"
                gradientUnits="userSpaceOnUse"
                x1="626.751"
                y1="631.5631"
                x2="1626.4935"
                y2="631.5631"
              >
                <stop offset="0" style="stop-color: #99cccc" />
                <stop offset="1" style="stop-color: #a8dadc" />
              </linearGradient>
              <path
                class="st3"
                d="M1626.49,697.47l0-349.82l-333.25,192.4C1180.35,475.84,960,347.65,960,347.65L627.64,539.54l-0.89,0.52
  L960,732.45l0,0l302.95,174.91c18.75,10.82,41.84,10.82,60.59,0l272.66-157.42C1614.95,739.12,1626.49,719.11,1626.49,697.47z"
              />
              <polygon
                class="st4"
                points="626.75,540.05 627.64,539.54 626.75,540.05 	"
              />
              <rect
                x="793.37"
                y="443.85"
                class="st4"
                width="0"
                height="384.8"
              />
              <polygon
                class="st4"
                points="626.75,540.05 626.75,540.05 626.75,540.05 	"
              />
              <path
                class="st5"
                d="M1626.49,347.65l-302.95-174.91c-18.75-10.82-41.84-10.82-60.59,0L960,347.65l333.25,192.4
  C1405.44,474.43,1626.49,347.65,1626.49,347.65z"
              />
              <path
                class="st5"
                d="M960,347.65c0,0,220.35,128.19,333.25,192.4L960,347.65z"
              />
            </g>
          </svg>
          <p class="end-logo-text">codevis</p>
        </a>
      </div>
      <div class="footer-column-container">
        <div class="footer-column footer-col1 footer-mobile-hidden">
          <p class="footer-mobile-hidden">
            Folge uns auf unseren Social Media Kanälen um nichts zu verpassen.
          </p>
          <div class="social-media">
            <a href="https://www.linkedin.com/company/codevis/">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                class="social-media-icon icon-tabler icon-tabler-brand-linkedin"
                width="25"
                height="25"
                viewBox="0 0 24 24"
                stroke-width="1"
                stroke="#ffffff"
                fill="none"
                stroke-linecap="round"
                stroke-linejoin="round"
              >
                <path stroke="none" d="M0 0h24v24H0z" fill="none" />
                <rect x="4" y="4" width="16" height="16" rx="2" />
                <line x1="8" y1="11" x2="8" y2="16" />
                <line x1="8" y1="8" x2="8" y2="8.01" />
                <line x1="12" y1="16" x2="12" y2="11" />
                <path d="M16 16v-3a2 2 0 0 0 -4 0" />
              </svg>
            </a>
            <a href="https://twitter.com/codevis_de">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                class="social-media-icon icon-tabler icon-tabler-brand-twitter"
                width="25"
                height="25"
                viewBox="0 0 24 24"
                stroke-width="1"
                stroke="#ffffff"
                fill="none"
                stroke-linecap="round"
                stroke-linejoin="round"
              >
                <path stroke="none" d="M0 0h24v24H0z" fill="none" />
                <path
                  d="M22 4.01c-1 .49 -1.98 .689 -3 .99c-1.121 -1.265 -2.783 -1.335 -4.38 -.737s-2.643 2.06 -2.62 3.737v1c-3.245 .083 -6.135 -1.395 -8 -4c0 0 -4.182 7.433 4 11c-1.872 1.247 -3.739 2.088 -6 2c3.308 1.803 6.913 2.423 10.034 1.517c3.58 -1.04 6.522 -3.723 7.651 -7.742a13.84 13.84 0 0 0 .497 -3.753c-.002 -.249 1.51 -2.772 1.818 -4.013z"
                />
              </svg>
            </a>
            <a href="https://www.instagram.com/codevis_de/">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                class="social-media-icon icon-tabler icon-tabler-brand-instagram"
                width="25"
                height="25"
                viewBox="0 0 24 24"
                stroke-width="1"
                stroke="#ffffff"
                fill="none"
                stroke-linecap="round"
                stroke-linejoin="round"
              >
                <path stroke="none" d="M0 0h24v24H0z" fill="none" />
                <rect x="4" y="4" width="16" height="16" rx="4" />
                <circle cx="12" cy="12" r="3" />
                <line x1="16.5" y1="7.5" x2="16.5" y2="7.501" />
              </svg>
            </a>
            <a href="https://www.facebook.com/Codevis-107326738664886">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                class="social-media-icon icon-tabler icon-tabler-brand-facebook"
                width="25"
                height="25"
                viewBox="0 0 24 24"
                stroke-width="1"
                stroke="#ffffff"
                fill="none"
                stroke-linecap="round"
                stroke-linejoin="round"
              >
                <path stroke="none" d="M0 0h24v24H0z" fill="none" />
                <path
                  d="M7 10v4h3v7h4v-7h3l1 -4h-4v-2a1 1 0 0 1 1 -1h3v-4h-3a5 5 0 0 0 -5 5v2h-3"
                />
              </svg>
            </a>
            <a href="https://github.com/codevis-dev">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                class="social-media-icon icon-tabler icon-tabler-brand-github"
                width="25"
                height="25"
                viewBox="0 0 24 24"
                stroke-width="1"
                stroke="#ffffff"
                fill="none"
                stroke-linecap="round"
                stroke-linejoin="round"
              >
                <path stroke="none" d="M0 0h24v24H0z" fill="none" />
                <path
                  d="M9 19c-4.3 1.4 -4.3 -2.5 -6 -3m12 5v-3.5c0 -1 .1 -1.4 -.5 -2c2.8 -.3 5.5 -1.4 5.5 -6a4.6 4.6 0 0 0 -1.3 -3.2a4.2 4.2 0 0 0 -.1 -3.2s-1.1 -.3 -3.5 1.3a12.3 12.3 0 0 0 -6.2 0c-2.4 -1.6 -3.5 -1.3 -3.5 -1.3a4.2 4.2 0 0 0 -.1 3.2a4.6 4.6 0 0 0 -1.3 3.2c0 4.6 2.7 5.7 5.5 6c-.6 .6 -.6 1.2 -.5 2v3.5"
                />
              </svg>
            </a>
          </div>
        </div>
        <div class="footer-column footer-col2">
          <h6 class="footer-mobile-hidden" id="fpad">Übersicht</h6>
          <a class="footer-link" href="../projects">Projekte</a>
          <a class="footer-link" href="../about">Über uns</a>
          <a class="footer-link footer-mobile-hidden" href="../contact"
            >Kontakt</a
          >
        </div>
        <div class="footer-column footer-col1 footer-mobile-shown">
          <div class="social-media">
            <a href="https://www.linkedin.com/company/codevis/">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                class="social-media-icon icon-tabler icon-tabler-brand-linkedin"
                width="25"
                height="25"
                viewBox="0 0 24 24"
                stroke-width="1"
                stroke="#ffffff"
                fill="none"
                stroke-linecap="round"
                stroke-linejoin="round"
              >
                <path stroke="none" d="M0 0h24v24H0z" fill="none" />
                <rect x="4" y="4" width="16" height="16" rx="2" />
                <line x1="8" y1="11" x2="8" y2="16" />
                <line x1="8" y1="8" x2="8" y2="8.01" />
                <line x1="12" y1="16" x2="12" y2="11" />
                <path d="M16 16v-3a2 2 0 0 0 -4 0" />
              </svg>
            </a>
            <a href="https://twitter.com/codevis_de">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                class="social-media-icon icon-tabler icon-tabler-brand-twitter"
                width="25"
                height="25"
                viewBox="0 0 24 24"
                stroke-width="1"
                stroke="#ffffff"
                fill="none"
                stroke-linecap="round"
                stroke-linejoin="round"
              >
                <path stroke="none" d="M0 0h24v24H0z" fill="none" />
                <path
                  d="M22 4.01c-1 .49 -1.98 .689 -3 .99c-1.121 -1.265 -2.783 -1.335 -4.38 -.737s-2.643 2.06 -2.62 3.737v1c-3.245 .083 -6.135 -1.395 -8 -4c0 0 -4.182 7.433 4 11c-1.872 1.247 -3.739 2.088 -6 2c3.308 1.803 6.913 2.423 10.034 1.517c3.58 -1.04 6.522 -3.723 7.651 -7.742a13.84 13.84 0 0 0 .497 -3.753c-.002 -.249 1.51 -2.772 1.818 -4.013z"
                />
              </svg>
            </a>
            <a href="https://www.instagram.com/codevis_de/">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                class="social-media-icon icon-tabler icon-tabler-brand-instagram"
                width="25"
                height="25"
                viewBox="0 0 24 24"
                stroke-width="1"
                stroke="#ffffff"
                fill="none"
                stroke-linecap="round"
                stroke-linejoin="round"
              >
                <path stroke="none" d="M0 0h24v24H0z" fill="none" />
                <rect x="4" y="4" width="16" height="16" rx="4" />
                <circle cx="12" cy="12" r="3" />
                <line x1="16.5" y1="7.5" x2="16.5" y2="7.501" />
              </svg>
            </a>
            <a href="https://www.facebook.com/Codevis-107326738664886">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                class="social-media-icon icon-tabler icon-tabler-brand-facebook"
                width="25"
                height="25"
                viewBox="0 0 24 24"
                stroke-width="1"
                stroke="#ffffff"
                fill="none"
                stroke-linecap="round"
                stroke-linejoin="round"
              >
                <path stroke="none" d="M0 0h24v24H0z" fill="none" />
                <path
                  d="M7 10v4h3v7h4v-7h3l1 -4h-4v-2a1 1 0 0 1 1 -1h3v-4h-3a5 5 0 0 0 -5 5v2h-3"
                />
              </svg>
            </a>
            <a href="https://github.com/codevis-dev">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                class="social-media-icon icon-tabler icon-tabler-brand-github"
                width="25"
                height="25"
                viewBox="0 0 24 24"
                stroke-width="1"
                stroke="#ffffff"
                fill="none"
                stroke-linecap="round"
                stroke-linejoin="round"
              >
                <path stroke="none" d="M0 0h24v24H0z" fill="none" />
                <path
                  d="M9 19c-4.3 1.4 -4.3 -2.5 -6 -3m12 5v-3.5c0 -1 .1 -1.4 -.5 -2c2.8 -.3 5.5 -1.4 5.5 -6a4.6 4.6 0 0 0 -1.3 -3.2a4.2 4.2 0 0 0 -.1 -3.2s-1.1 -.3 -3.5 1.3a12.3 12.3 0 0 0 -6.2 0c-2.4 -1.6 -3.5 -1.3 -3.5 -1.3a4.2 4.2 0 0 0 -.1 3.2a4.6 4.6 0 0 0 -1.3 3.2c0 4.6 2.7 5.7 5.5 6c-.6 .6 -.6 1.2 -.5 2v3.5"
                />
              </svg>
            </a>
          </div>
        </div>
        <div class="footer-column footer-col3">
          <h6 class="footer-mobile-hidden fpad">Rechtliches</h6>
          <a class="footer-link" href="../impressum">Impressum</a>
          <a class="footer-link" href="../dsgvo">Datenschutzerklärung</a>
        </div>
      </div>
      <p class="footer-copyright">© codevis 2022</p>
    </div>
    <!-- End Footer -->
  </body>
  <script src="../script.js"></script>
</html>
